# 4. Пользователь вводит две буквы.
#  Определить, на каких местах алфавита они стоят, и сколько между ними находится букв.

print("====================================================")
print("Определение места буквы в английском алфавите")
print("====================================================")
s1 = input("Введите букву: ").upper()
s2 = input("Введите букву: ").upper()

n1 = ord(s1)
n2 = ord(s2)

if(n1 > 64 & n1 < 91):
    m1 = n1 - 64

if(n2 > 64 & n2 < 91):
    m2 = n2 - 64

print(f'Буква {s1} в алфавите под номером {m1}. ')
print(f'Буква {s2} в алфавите под номером {m2}. ')
print(f'Между ними {m2-m1-1} букв(ы)')

print("====================================================")