# 5. Пользователь вводит номер буквы в алфавите. Определить, какая это буква.

print("====================================================")
print("Определение буквы в английском алфавите по номеру")
print("====================================================")

s = input("Введите номер буквы: ").upper()

n = ord(s)
m = 0

if(n > 64 & n < 91):
    m = n - 64

print(f'Буква {s} в алфавите под номером {m}. ')

